read_verilog arqui.v

hierarchy -check -top arqui

proc; opt; fsm; opt; memory; opt; techmap; opt;

dfflibmap -liberty ./CMOS/cmos_cells.lib

abc -liberty ./CMOS/cmos_cells.lib

clean

show -notitle -format pdf -prefix modulo_diagramCMOS -lib ./CMOS/cmos_cells.v arqui

write_verilog -noattr  arqui_Synth.v
